Revit 2027 API
ExporterIFC.RegisterDoorWindowForUncreatedOpening Method
 Registers a door or window in the ExporterIFC's internal cache. The ids registered correspond to openings in walls which have not been processed and created yet.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RegisterDoorWindowForUncreatedOpening(
	ElementId familyInstanceId,
	IFCAnyHandle instanceHandle
)
Public Sub RegisterDoorWindowForUncreatedOpening (
	familyInstanceId As ElementId,
	instanceHandle As IFCAnyHandle
)
public:
void RegisterDoorWindowForUncreatedOpening(
	ElementId^ familyInstanceId,
	IFCAnyHandle^ instanceHandle
)
member RegisterDoorWindowForUncreatedOpening :
        familyInstanceId : ElementId *
        instanceHandle : IFCAnyHandle -> unit
Parameters
familyInstanceId ElementId
 The id of the door or window.
instanceHandle IFCAnyHandle
 The handle to the IfcDoor or IfcWindow created for this instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace